[
  {
    "author": "Kausar Ahmad",
    "author_email": "kausar.ahmad.tasin01@gmail.com",
    "layers": {
      "1": {
        "title": "The Enchanted Forest",
        "storyLine": "You find yourself at the entrance of the Enchanted Forest, a place of mystery and magic. The forest is dense, with towering trees and a mist that hangs in the air. Before you, two paths diverge.",
        "choices": {
          "choice_1_1": "Take the left path",
          "choice_1_2": "Take the right path"
        },
        "views": 100,
        "timeSpent": 500
      },
      "1_1": {
        "title": "The Dark Grove",
        "storyLine": "As you venture down the left path, the trees grow taller and the light dims. You soon find yourself in a dark grove where strange noises echo through the trees.",
        "choices": {
          "choice_1_1_1": "Investigate the strange noises",
          "choice_1_1_2": "Continue deeper into the grove"
        },
        "views": 75,
        "timeSpent": 350
      },
      "1_1_1": {
        "title": "The Whispering Shadows",
        "storyLine": "You cautiously approach the source of the noise. In the shadows, you find a group of mysterious figures whispering in an ancient language. They suddenly turn towards you.",
        "views": 50,
        "timeSpent": 200
      },
      "1_1_2": {
        "title": "The Hidden Glade",
        "storyLine": "You push further into the grove and discover a hidden glade, where the sunlight breaks through the trees, revealing an ancient stone circle.",
        "views": 25,
        "timeSpent": 100
      },
      "1_2": {
        "title": "The Riverbank",
        "storyLine": "Taking the right path, you follow the sound of flowing water and soon arrive at a serene riverbank. The water is clear and the surroundings peaceful.",
        "choices": {
          "choice_1_2_1": "Follow the river upstream",
          "choice_1_2_2": "Cross the river"
        },
        "views": 85,
        "timeSpent": 400
      },
      "1_2_1": {
        "title": "The Waterfall",
        "storyLine": "You follow the river upstream and eventually reach a majestic waterfall, hidden deep within the forest.",
        "views": 60,
        "timeSpent": 250
      },
      "1_2_2": {
        "title": "The Ancient Bridge",
        "storyLine": "You decide to cross the river and discover an ancient, moss-covered bridge leading further into the forest.",
        "views": 45,
        "timeSpent": 180
      }
    }
  },
  {
    "author": "Kausar Ahmad",
    "author_email": "kausar.ahmad.tasin01@gmail.com",
    "layers": {
      "1": {
        "title": "The Time Traveler's Dilemma",
        "storyLine": "You stumble upon a mysterious device hidden in your attic. It hums with energy, and upon closer inspection, you realize it's a time machine. Two buttons are available: one marked 'Past' and the other 'Future'.",
        "choices": {
          "choice_1_1": "Press 'Past'",
          "choice_1_2": "Press 'Future'"
        },
        "views": 120,
        "timeSpent": 600
      },
      "1_1": {
        "title": "Journey to the Past",
        "storyLine": "You press the button labeled 'Past'. The room spins and blurs, and when everything comes into focus, you find yourself in a medieval village. The air smells of wood smoke and the sound of blacksmiths' hammers rings through the air.",
        "choices": {
          "choice_1_1_1": "Explore the village",
          "choice_1_1_2": "Find a way back to the present"
        },
        "views": 95,
        "timeSpent": 450
      },
      "1_1_1": {
        "title": "The Village Blacksmith",
        "storyLine": "You wander through the village and come across a blacksmith working on a sword. He looks up and offers to tell you about the history of the land.",
        "views": 70,
        "timeSpent": 300
      },
      "1_1_2": {
        "title": "The Ancient Ruins",
        "storyLine": "In your search for a way back, you discover ancient ruins just outside the village. The ruins seem to pulse with a strange energy, similar to the time machine.",
        "views": 25,
        "timeSpent": 150
      },
      "1_2": {
        "title": "Leap into the Future",
        "storyLine": "You press the button labeled 'Future'. The world around you shifts, and you find yourself in a gleaming city with flying cars and towering skyscrapers. The future is dazzling, but also a bit overwhelming.",
        "choices": {
          "choice_1_2_1": "Explore the city",
          "choice_1_2_2": "Try to find a way back to your own time"
        },
        "views": 85,
        "timeSpent": 400
      },
      "1_2_1": {
        "title": "The Futuristic Market",
        "storyLine": "As you walk through the city, you come across a bustling market full of strange and advanced technology. Vendors are selling everything from hoverboards to virtual reality experiences.",
        "views": 60,
        "timeSpent": 250
      },
      "1_2_2": {
        "title": "The Time Research Lab",
        "storyLine": "You ask around for information on time travel and are directed to a high-tech research lab. Scientists there are working on new methods of temporal manipulation.",
        "views": 45,
        "timeSpent": 180
      }
    }
  },
  {
    "author": "Kausar Ahmad",
    "author_email": "kausar.ahmad.tasin01@gmail.com",
    "layers": {
      "1": {
        "title": "The Secret of the Abandoned Manor",
        "storyLine": "You stand before the gates of an old, abandoned manor on the outskirts of town. The house is rumored to be haunted, but something draws you in. The gate creaks open, inviting you to explore.",
        "choices": {
          "choice_1_1": "Enter through the front door",
          "choice_1_2": "Search around the back"
        },
        "views": 130,
        "timeSpent": 700
      },
      "1_1": {
        "title": "The Grand Hall",
        "storyLine": "You push open the front door and step into a grand hall, with dusty chandeliers hanging from the ceiling. The air is thick with the smell of old wood and forgotten memories.",
        "choices": {
          "choice_1_1_1": "Investigate the old piano",
          "choice_1_1_2": "Climb the grand staircase"
        },
        "views": 90,
        "timeSpent": 480
      },
      "1_1_1": {
        "title": "The Haunted Melody",
        "storyLine": "You approach the piano and lightly press a key. To your surprise, a haunting melody fills the hall, though your hands remain still. The music seems to come from within the piano itself.",
        "views": 65,
        "timeSpent": 320
      },
      "1_1_2": {
        "title": "The Creaking Staircase",
        "storyLine": "You decide to climb the grand staircase, each step creaking under your weight. The shadows seem to shift and move as you ascend, making you question what lies ahead.",
        "views": 25,
        "timeSpent": 150
      },
      "1_2": {
        "title": "The Overgrown Garden",
        "storyLine": "You decide to circle around the manor and find yourself in an overgrown garden. The once-beautiful flowers are now tangled weeds, and the air is filled with the sound of rustling leaves.",
        "choices": {
          "choice_1_2_1": "Explore the old greenhouse",
          "choice_1_2_2": "Investigate the crumbling statue"
        },
        "views": 85,
        "timeSpent": 410
      },
      "1_2_1": {
        "title": "The Greenhouse Mystery",
        "storyLine": "You push open the door to the greenhouse, and a rush of warm, damp air greets you. Inside, you find strange plants growing in shattered pots, with vines creeping along the glass walls.",
        "views": 60,
        "timeSpent": 260
      },
      "1_2_2": {
        "title": "The Hidden Key",
        "storyLine": "You approach the crumbling statue and notice something glinting in the dirt. It's a key, old and rusted, but perhaps still functional.",
        "views": 45,
        "timeSpent": 200
      }
    }
  }
]
